app/views/users/_user.html.erb

SELECT "assignments".* FROM "assignments" WHERE "assignments"."user_id" = 11
SELECT "courses".* FROM "courses" INNER JOIN "assignments" ON "courses"."id" = "assignments"."course_id" WHERE "assignments"."user_id" = 11
SELECT "groups".* FROM "groups" INNER JOIN "assignments" ON "groups"."id" = "assignments"."group_id" WHERE "assignments"."user_id" = 11
---

 <% if user.assignments.collect(&:group_id).include?(1) %>

      <li class="four columns card-layout <%= user.groups.collect(&:name).uniq.to_sentence.downcase %> <%= user.courses.collect(&:id).uniq.join(" ") %>">