app/views/users/show.html.erb


      <!-- <%# if User.find(session[:uid]).id == @user.id %> -->
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "69"]]

				<div class="row sub-group-block">
					<h5><%= @user.groups.collect(&:name).uniq.to_sentence %> <%= @user.quarter %></h5>
          <h3><%= @user.courses.collect(&:name).uniq.to_sentence %></h3>
---
SELECT "groups".* FROM "groups" INNER JOIN "assignments" ON "groups"."id" = "assignments"."group_id" WHERE "assignments"."user_id" = 69
SELECT "courses".* FROM "courses" INNER JOIN "assignments" ON "courses"."id" = "assignments"."course_id" WHERE "assignments"."user_id" = 69