app/controllers/notes_controller.rb

  def create
    @note = Note.new(params[:notes])

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("created_at", "description", "guest_id", "star", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 19 Jun 2012 15:08:02 UTC +00:00], ["description", nil], ["guest_id", nil], ["star", nil], ["updated_at", Tue, 19 Jun 2012 15:08:02 UTC +00:00], ["user_id", nil]]