app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (first_name LIKE '%hughes%') LIMIT 30 OFFSET 0
---
  def index
    @users = User.paginate(:page => params[:page], :per_page => 20)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "favicon"]]
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 69
---
  def show
    @user = User.find(params[:id])
    @note = Note.all